[NoCoverage] ObjectLiteral
src/app/app-routing.module.ts:10:3
 
 
 const routes: Routes = [
-  { path: 'policies', component: PolicyListComponent },
+  {},
   { path: 'policy-detail', component: PolicyDetailComponent }
 ];

[NoCoverage] StringLiteral
src/app/app-routing.module.ts:10:11
 
 
 const routes: Routes = [
-  { path: 'policies', component: PolicyListComponent },
+  { path: "", component: PolicyListComponent },
   { path: 'policy-detail', component: PolicyDetailComponent }
 ];
