[NoCoverage] BooleanLiteral
src/app/config.service.ts:5:39
 //contains a flag indicating whether to use the mock data service or the real backend service.
 
 export class ConfigService {
-    private useMockService: boolean = true;
+    private useMockService: boolean = false;
   
     public useMock(): boolean {

[NoCoverage] BlockStatement
src/app/config.service.ts:7:31
 export class ConfigService {
     private useMockService: boolean = true;
   
-    public useMock(): boolean {
-      return this.useMockService;
-    }
+    public useMock(): boolean {}
   
     public setUseMock(value: boolean): void {

[NoCoverage] BlockStatement
src/app/config.service.ts:11:45
       return this.useMockService;
     }
   
-    public setUseMock(value: boolean): void {
-      this.useMockService = value;
-    }
+    public setUseMock(value: boolean): void {}
   }
   
