[NoCoverage] BlockStatement
src/app/mock-data.service.ts:12:13
 
   constructor() { }
   
-  createDb(){
-
-    let  policies =  [
-      {  id:  111,  num:  'PO1', amount: 512.99, userId: 14521, clientId: 45, description: 'Life Insurance - Term Plan' },
-      {  id:  112,  num:  'PO2', amount: 718.87, userId: 14588, clientId: 87, description: 'Personal Care - Accedential Death' },
-      {  id:  113,  num:  'PO3', amount: 129.65, userId: 10213, clientId: 98, description: 'Home Loan - Secure' },
-      {  id:  114,  num:  'PO4', amount: 302.19, userId: 11968, clientId: 33, description: 'Travel - Insurance ' }
-     ];
-   
-   return {policies};
-
-  }
+  createDb(){}
 }
 

[NoCoverage] StringLiteral
src/app/mock-data.service.ts:15:27
   createDb(){
 
     let  policies =  [
-      {  id:  111,  num:  'PO1', amount: 512.99, userId: 14521, clientId: 45, description: 'Life Insurance - Term Plan' },
+      {  id:  111,  num:  "", amount: 512.99, userId: 14521, clientId: 45, description: 'Life Insurance - Term Plan' },
       {  id:  112,  num:  'PO2', amount: 718.87, userId: 14588, clientId: 87, description: 'Personal Care - Accedential Death' },
       {  id:  113,  num:  'PO3', amount: 129.65, userId: 10213, clientId: 98, description: 'Home Loan - Secure' },

[NoCoverage] StringLiteral
src/app/mock-data.service.ts:16:92
 
     let  policies =  [
       {  id:  111,  num:  'PO1', amount: 512.99, userId: 14521, clientId: 45, description: 'Life Insurance - Term Plan' },
-      {  id:  112,  num:  'PO2', amount: 718.87, userId: 14588, clientId: 87, description: 'Personal Care - Accedential Death' },
+      {  id:  112,  num:  'PO2', amount: 718.87, userId: 14588, clientId: 87, description: "" },
       {  id:  113,  num:  'PO3', amount: 129.65, userId: 10213, clientId: 98, description: 'Home Loan - Secure' },
       {  id:  114,  num:  'PO4', amount: 302.19, userId: 11968, clientId: 33, description: 'Travel - Insurance ' }

[NoCoverage] StringLiteral
src/app/mock-data.service.ts:16:27
 
     let  policies =  [
       {  id:  111,  num:  'PO1', amount: 512.99, userId: 14521, clientId: 45, description: 'Life Insurance - Term Plan' },
-      {  id:  112,  num:  'PO2', amount: 718.87, userId: 14588, clientId: 87, description: 'Personal Care - Accedential Death' },
+      {  id:  112,  num:  "", amount: 718.87, userId: 14588, clientId: 87, description: 'Personal Care - Accedential Death' },
       {  id:  113,  num:  'PO3', amount: 129.65, userId: 10213, clientId: 98, description: 'Home Loan - Secure' },
       {  id:  114,  num:  'PO4', amount: 302.19, userId: 11968, clientId: 33, description: 'Travel - Insurance ' }

[NoCoverage] ObjectLiteral
src/app/mock-data.service.ts:17:7
     let  policies =  [
       {  id:  111,  num:  'PO1', amount: 512.99, userId: 14521, clientId: 45, description: 'Life Insurance - Term Plan' },
       {  id:  112,  num:  'PO2', amount: 718.87, userId: 14588, clientId: 87, description: 'Personal Care - Accedential Death' },
-      {  id:  113,  num:  'PO3', amount: 129.65, userId: 10213, clientId: 98, description: 'Home Loan - Secure' },
+      {},
       {  id:  114,  num:  'PO4', amount: 302.19, userId: 11968, clientId: 33, description: 'Travel - Insurance ' }
      ];

[NoCoverage] StringLiteral
src/app/mock-data.service.ts:17:27
     let  policies =  [
       {  id:  111,  num:  'PO1', amount: 512.99, userId: 14521, clientId: 45, description: 'Life Insurance - Term Plan' },
       {  id:  112,  num:  'PO2', amount: 718.87, userId: 14588, clientId: 87, description: 'Personal Care - Accedential Death' },
-      {  id:  113,  num:  'PO3', amount: 129.65, userId: 10213, clientId: 98, description: 'Home Loan - Secure' },
+      {  id:  113,  num:  "", amount: 129.65, userId: 10213, clientId: 98, description: 'Home Loan - Secure' },
       {  id:  114,  num:  'PO4', amount: 302.19, userId: 11968, clientId: 33, description: 'Travel - Insurance ' }
      ];

[NoCoverage] StringLiteral
src/app/mock-data.service.ts:18:27
       {  id:  111,  num:  'PO1', amount: 512.99, userId: 14521, clientId: 45, description: 'Life Insurance - Term Plan' },
       {  id:  112,  num:  'PO2', amount: 718.87, userId: 14588, clientId: 87, description: 'Personal Care - Accedential Death' },
       {  id:  113,  num:  'PO3', amount: 129.65, userId: 10213, clientId: 98, description: 'Home Loan - Secure' },
-      {  id:  114,  num:  'PO4', amount: 302.19, userId: 11968, clientId: 33, description: 'Travel - Insurance ' }
+      {  id:  114,  num:  "", amount: 302.19, userId: 11968, clientId: 33, description: 'Travel - Insurance ' }
      ];
    
