[NoCoverage] BlockStatement
src/app/policy-list/policy-list.component.ts:19:7
   constructor(private policyService: PolicyService) { }
 
     ngOnInit()
-      {
-      this.getPolicyData()
-    }
+      {}
 
     getPolicyData (): void

[NoCoverage] BlockStatement
src/app/policy-list/policy-list.component.ts:24:5
     }
 
     getPolicyData (): void
-    {
-
-      this.policyService.getPolicies().subscribe
-      (
-          (data: any): void =>
-          {
-          console.log(data);
-          this.policies = data;
-          this.policyArray = data;
-          }
-      )
-
-    }
+    {}
 
     viewButton(policy : policydataitem):void

[NoCoverage] BlockStatement
src/app/policy-list/policy-list.component.ts:29:11
       this.policyService.getPolicies().subscribe
       (
           (data: any): void =>
-          {
-          console.log(data);
-          this.policies = data;
-          this.policyArray = data;
-          }
+          {}
       )
 

[NoCoverage] BlockStatement
src/app/policy-list/policy-list.component.ts:39:5
     }
 
     viewButton(policy : policydataitem):void
-    {
-      console.log(policy.id);
-    }
+    {}
       
     // navigateToPolicyDetail( policy : policydataitem ) :void

[Killed] BlockStatement
src/app/policy-list/policy-list.component.ts:53:5
     // }
     
     deleteButton(policy : policydataitem): void 
-    {      
-      const policyFiltered = this.policyArray?.filter(p => p !== policy);
-      
-      if (!policyFiltered)
-      {    
-        
-        this.policyService.deletePolicy1(policy).subscribe();
-        console.log('inside - False ');
-      }
-
-      if (policyFiltered)
-      {
-      
-        this.policyService.deletePolicy1(policy).subscribe();
-        console.log('inside  - True ');
-      }
-
-      this.policyArray = policyFiltered;
-
-
-    }
+    {}
 
  
killedBy: PolicyListComponent should call delete button
statusReason: Expected spy mockPolicyService.deletePolicy1 to have been called with:
  [ Object({ id: 113, num: 'PO3', amount: 129.65, userId: 10213, clientId: 98, description: 'Home Loan - Secure' }) ]
but it was never called.

[Killed] OptionalChaining
src/app/policy-list/policy-list.component.ts:54:30
     
     deleteButton(policy : policydataitem): void 
     {      
-      const policyFiltered = this.policyArray?.filter(p => p !== policy);
+      const policyFiltered = this.policyArray.filter(p => p !== policy);
       
       if (!policyFiltered)
killedBy: PolicyListComponent should remove the indicated policy from the policy list
statusReason: TypeError: Cannot read properties of undefined (reading 'filter')

[NoCoverage] ArrowFunction
src/app/policy-list/policy-list.component.ts:54:55
     
     deleteButton(policy : policydataitem): void 
     {      
-      const policyFiltered = this.policyArray?.filter(p => p !== policy);
+      const policyFiltered = this.policyArray?.filter(() => undefined);
       
       if (!policyFiltered)

[Killed] ConditionalExpression
src/app/policy-list/policy-list.component.ts:56:11
     {      
       const policyFiltered = this.policyArray?.filter(p => p !== policy);
       
-      if (!policyFiltered)
+      if (false)
       {    
         
killedBy: PolicyListComponent should call delete button
statusReason: Expected spy mockPolicyService.deletePolicy1 to have been called with:
  [ Object({ id: 113, num: 'PO3', amount: 129.65, userId: 10213, clientId: 98, description: 'Home Loan - Secure' }) ]
but it was never called.

[Killed] BooleanLiteral
src/app/policy-list/policy-list.component.ts:56:11
     {      
       const policyFiltered = this.policyArray?.filter(p => p !== policy);
       
-      if (!policyFiltered)
+      if (policyFiltered)
       {    
         
killedBy: PolicyListComponent should call delete button
statusReason: Expected spy mockPolicyService.deletePolicy1 to have been called with:
  [ Object({ id: 113, num: 'PO3', amount: 129.65, userId: 10213, clientId: 98, description: 'Home Loan - Secure' }) ]
but it was never called.

[Killed] BlockStatement
src/app/policy-list/policy-list.component.ts:57:7
       const policyFiltered = this.policyArray?.filter(p => p !== policy);
       
       if (!policyFiltered)
-      {    
-        
-        this.policyService.deletePolicy1(policy).subscribe();
-        console.log('inside - False ');
-      }
+      {}
 
       if (policyFiltered)
killedBy: PolicyListComponent should call delete button
statusReason: Expected spy mockPolicyService.deletePolicy1 to have been called with:
  [ Object({ id: 113, num: 'PO3', amount: 129.65, userId: 10213, clientId: 98, description: 'Home Loan - Secure' }) ]
but it was never called.

[Survived] ConditionalExpression
src/app/policy-list/policy-list.component.ts:63:11
         console.log('inside - False ');
       }
 
-      if (policyFiltered)
+      if (true)
       {
       

[Survived] ConditionalExpression
src/app/policy-list/policy-list.component.ts:63:11
         console.log('inside - False ');
       }
 
-      if (policyFiltered)
+      if (false)
       {
       

[NoCoverage] BlockStatement
src/app/policy-list/policy-list.component.ts:64:7
       }
 
       if (policyFiltered)
-      {
-      
-        this.policyService.deletePolicy1(policy).subscribe();
-        console.log('inside  - True ');
-      }
+      {}
 
       this.policyArray = policyFiltered;
