[Survived] ObjectLiteral
src/app/policy.service.ts:6:21
 import { Observable, catchError, of, tap } from 'rxjs';
 import { policydataitem } from './model/policydataitem'
 
-const httpOptions = {
-  headers: new HttpHeaders({ 'Content-Type': 'application/json' })
-};
+const httpOptions = {};
 
 

[Survived] ObjectLiteral
src/app/policy.service.ts:7:28
 import { policydataitem } from './model/policydataitem'
 
 const httpOptions = {
-  headers: new HttpHeaders({ 'Content-Type': 'application/json' })
+  headers: new HttpHeaders({})
 };
 

[NoCoverage] StringLiteral
src/app/policy.service.ts:19:24
 {
 
   constructor(private httpClient: HttpClient) { }
-  SERVER_URL: string = 'http://localhost:8080/api/';
+  SERVER_URL: string = "";
 
 // GET policies from the server 

[NoCoverage] BlockStatement
src/app/policy.service.ts:22:46
   SERVER_URL: string = 'http://localhost:8080/api/';
 
 // GET policies from the server 
-getPolicies (): Observable<policydataitem[]> {
-  return this.httpClient.get<policydataitem[]>(this.SERVER_URL + 'policies')
-    .pipe(
-      tap(policies => this.log('fetched policies')),
-      catchError(this.handleError('getpolicies1',[]))
-    );
-}
+getPolicies (): Observable<policydataitem[]> {}
 
   /** GET Policy by id. Will 404 if id not found */

[NoCoverage] StringLiteral
src/app/policy.service.ts:23:66
 
 // GET policies from the server 
 getPolicies (): Observable<policydataitem[]> {
-  return this.httpClient.get<policydataitem[]>(this.SERVER_URL + 'policies')
+  return this.httpClient.get<policydataitem[]>(this.SERVER_URL + "")
     .pipe(
       tap(policies => this.log('fetched policies')),

[NoCoverage] ArrowFunction
src/app/policy.service.ts:25:11
 getPolicies (): Observable<policydataitem[]> {
   return this.httpClient.get<policydataitem[]>(this.SERVER_URL + 'policies')
     .pipe(
-      tap(policies => this.log('fetched policies')),
+      tap(() => undefined),
       catchError(this.handleError('getpolicies1',[]))
     );

[NoCoverage] BlockStatement
src/app/policy.service.ts:31:57
 }
 
   /** GET Policy by id. Will 404 if id not found */
-  getPolicyById(id: number): Observable<policydataitem> {
-    const url = `${this.SERVER_URL}+${id}`;
-    return this.httpClient.get<policydataitem>(url).pipe(
-      tap(_ => this.log(`fetched policy id=${id}`)),
-      catchError(this.handleError<policydataitem>(`getPolicyById Policyid=${id}`))
-    );
-  }
+  getPolicyById(id: number): Observable<policydataitem> {}
 
     // /** PUT: update the policy on the server */

[NoCoverage] StringLiteral
src/app/policy.service.ts:32:17
 
   /** GET Policy by id. Will 404 if id not found */
   getPolicyById(id: number): Observable<policydataitem> {
-    const url = `${this.SERVER_URL}+${id}`;
+    const url = ``;
     return this.httpClient.get<policydataitem>(url).pipe(
       tap(_ => this.log(`fetched policy id=${id}`)),

[NoCoverage] ArrowFunction
src/app/policy.service.ts:34:11
   getPolicyById(id: number): Observable<policydataitem> {
     const url = `${this.SERVER_URL}+${id}`;
     return this.httpClient.get<policydataitem>(url).pipe(
-      tap(_ => this.log(`fetched policy id=${id}`)),
+      tap(() => undefined),
       catchError(this.handleError<policydataitem>(`getPolicyById Policyid=${id}`))
     );

[NoCoverage] StringLiteral
src/app/policy.service.ts:35:51
     const url = `${this.SERVER_URL}+${id}`;
     return this.httpClient.get<policydataitem>(url).pipe(
       tap(_ => this.log(`fetched policy id=${id}`)),
-      catchError(this.handleError<policydataitem>(`getPolicyById Policyid=${id}`))
+      catchError(this.handleError<policydataitem>(``))
     );
   }

[NoCoverage] BlockStatement
src/app/policy.service.ts:40:58
   }
 
     // /** PUT: update the policy on the server */
-  updatePolicy (policy: policydataitem): Observable<any> {
-    return this.httpClient.put(this.SERVER_URL, policydataitem, httpOptions).pipe(
-      tap(_ => this.log(`updated policy id=${policy.id}`)),
-      catchError(this.handleError<any>('updatepolicy'))
-    );
-  }
+  updatePolicy (policy: policydataitem): Observable<any> {}
 
 

[NoCoverage] ArrowFunction
src/app/policy.service.ts:42:11
     // /** PUT: update the policy on the server */
   updatePolicy (policy: policydataitem): Observable<any> {
     return this.httpClient.put(this.SERVER_URL, policydataitem, httpOptions).pipe(
-      tap(_ => this.log(`updated policy id=${policy.id}`)),
+      tap(() => undefined),
       catchError(this.handleError<any>('updatepolicy'))
     );

[NoCoverage] BlockStatement
src/app/policy.service.ts:49:78
 
 
   //   // /** DELETE: delete the policy from the server */
-  deletePolicy1(policy: policydataitem | number): Observable<policydataitem> {
-    const id = typeof policy === 'number' ? policy : policy.id;
-    //TO DO - update the below url which is 'http://localhost:8080/api/ + 1' - wrong
-    //const url = `${this.SERVER_URL}` + `${id}`;
-     const url = `${this.SERVER_URL + 'policies'}/${id}`;    
-
-    return this.httpClient.delete<policydataitem>(url,httpOptions).pipe(
-      tap(_ => this.log(`deleted policy id=${id}`)),
-      catchError(this.handleError<policydataitem>('deletepolicy1'))
-    );
-  }
+  deletePolicy1(policy: policydataitem | number): Observable<policydataitem> {}
 
 

[NoCoverage] ConditionalExpression
src/app/policy.service.ts:50:16
 
   //   // /** DELETE: delete the policy from the server */
   deletePolicy1(policy: policydataitem | number): Observable<policydataitem> {
-    const id = typeof policy === 'number' ? policy : policy.id;
+    const id = true ? policy : policy.id;
     //TO DO - update the below url which is 'http://localhost:8080/api/ + 1' - wrong
     //const url = `${this.SERVER_URL}` + `${id}`;

[NoCoverage] ConditionalExpression
src/app/policy.service.ts:50:16
 
   //   // /** DELETE: delete the policy from the server */
   deletePolicy1(policy: policydataitem | number): Observable<policydataitem> {
-    const id = typeof policy === 'number' ? policy : policy.id;
+    const id = false ? policy : policy.id;
     //TO DO - update the below url which is 'http://localhost:8080/api/ + 1' - wrong
     //const url = `${this.SERVER_URL}` + `${id}`;

[NoCoverage] ArrowFunction
src/app/policy.service.ts:56:11
      const url = `${this.SERVER_URL + 'policies'}/${id}`;    
 
     return this.httpClient.delete<policydataitem>(url,httpOptions).pipe(
-      tap(_ => this.log(`deleted policy id=${id}`)),
+      tap(() => undefined),
       catchError(this.handleError<policydataitem>('deletepolicy1'))
     );

[NoCoverage] BlockStatement
src/app/policy.service.ts:75:3
 
   
  public deletePolicyById(policyId: any)
-  {
-    return this.httpClient.delete(`${this.SERVER_URL + 'policies'}/${policyId}`)
-  }
+  {}
 
   // public getPolicyById(policyId: any)

[NoCoverage] BlockStatement
src/app/policy.service.ts:90:113
    
   // }
  
-public createPolicy(policy: {id: number, amount: number, clientId: number, userId: number, description: string}){
-    return this.httpClient.post(`${this.SERVER_URL + 'policies'}`, policy)
-}
+public createPolicy(policy: {id: number, amount: number, clientId: number, userId: number, description: string}){}
 
 

[NoCoverage] StringLiteral
src/app/policy.service.ts:91:33
   // }
  
 public createPolicy(policy: {id: number, amount: number, clientId: number, userId: number, description: string}){
-    return this.httpClient.post(`${this.SERVER_URL + 'policies'}`, policy)
+    return this.httpClient.post(``, policy)
 }
 

[NoCoverage] BlockStatement
src/app/policy.service.ts:99:30
 //   return this.httpClient.put(`${this.SERVER_URL + 'policies'}/${policy.id}`, policy)
 // }
 
-private log(message: string) {
-    
-  console.log('PolicyService: ' + message);
-}
+private log(message: string) {}
 
 private handleError<T> (operation = 'operation', result?: T) {

[NoCoverage] StringLiteral
src/app/policy.service.ts:101:15
 
 private log(message: string) {
     
-  console.log('PolicyService: ' + message);
+  console.log("" + message);
 }
 

[NoCoverage] BlockStatement
src/app/policy.service.ts:104:62
   console.log('PolicyService: ' + message);
 }
 
-private handleError<T> (operation = 'operation', result?: T) {
-  return (error: any): Observable<T> => {
-
-    // TODO: send the error to remote logging infrastructure
-    console.error(error); // log to console instead
-
-    // TODO: better job of transforming error for user consumption
-    this.log(`${operation} failed: ${error.message}`);
-
-    // Let the app keep running by returning an empty result.
-    return of(result as T);
-  };
-}
+private handleError<T> (operation = 'operation', result?: T) {}
 
 }

[NoCoverage] StringLiteral
src/app/policy.service.ts:104:37
   console.log('PolicyService: ' + message);
 }
 
-private handleError<T> (operation = 'operation', result?: T) {
+private handleError<T> (operation = "", result?: T) {
   return (error: any): Observable<T> => {
 

[NoCoverage] BlockStatement
src/app/policy.service.ts:105:41
 }
 
 private handleError<T> (operation = 'operation', result?: T) {
-  return (error: any): Observable<T> => {
-
-    // TODO: send the error to remote logging infrastructure
-    console.error(error); // log to console instead
-
-    // TODO: better job of transforming error for user consumption
-    this.log(`${operation} failed: ${error.message}`);
-
-    // Let the app keep running by returning an empty result.
-    return of(result as T);
-  };
+  return (error: any): Observable<T> => {};
 }
 

[NoCoverage] StringLiteral
src/app/policy.service.ts:111:14
     console.error(error); // log to console instead
 
     // TODO: better job of transforming error for user consumption
-    this.log(`${operation} failed: ${error.message}`);
+    this.log(``);
 
     // Let the app keep running by returning an empty result.
